{
    "insurance_change": "Request to update or change insurance details or policies.",
    "calendar_update": "Modify or update events in the user's calendar.",
    "replacement_card_duration": "Inquiry about the time it takes to receive a replacement card.",
    "international_visa": "Request for information or assistance with international visa processing.",
    "application_status": "Check the status of a submitted application.",
    "cook_time": "Query about the time required to prepare or cook a dish.",
    "distance": "Request to calculate or provide the distance between two locations.",
    "uber": "Inquiry or request related to booking an Uber or ride-sharing service.",
    "interest_rate": "Query about the current or applicable interest rates.",
    "make_call": "Request to initiate a phone call.",
    "rollover_401k": "Request information or assistance with rolling over a 401(k) retirement account.",
    "todo_list_update": "Update or modify the user's to-do list.",
    "international_fees": "Inquiry about fees for international transactions or services.",
    "who_do_you_work_for": "Query asking about the assistant's creator or organization.",
    "payday": "Inquiry about the date or details of the user's payday.",
    "order_status": "Check the status of an order.",
    "jump_start": "Request for information or assistance with jump-starting a vehicle.",
    "pto_request": "Request to apply for Paid Time Off (PTO).",
    "rewards_balance": "Check the balance of rewards or loyalty points.",
    "shopping_list_update": "Update or modify items in the user's shopping list.",
    "change_accent": "Request to change the voice accent of the assistant.",
    "current_location": "Query to determine the user's current geographical location.",
    "timezone": "Request information about the current or a specific timezone.",
    "book_flight": "Request to book a flight.",
    "whisper_mode": "Enable or inquire about a low-volume or discreet communication mode.",
    "calories": "Query about the calorie content of food or meals.",
    "todo_list": "Request to view the user's to-do list.",
    "what_is_your_name": "Query about the assistant's name or identity.",
    "credit_limit": "Inquiry about the user's credit card limit.",
    "play_music": "Request to play music.",
    "meal_suggestion": "Ask for suggestions on what to eat or prepare.",
    "pto_request_status": "Check the status of a submitted Paid Time Off (PTO) request.",
    "roll_dice": "Request to simulate rolling dice.",
    "tire_change": "Request for information or assistance with changing a vehicle tire.",
    "definition": "Ask for the definition of a word or term.",
    "account_blocked": "Inquiry or request related to unblocking a user account.",
    "change_speed": "Request to adjust playback or operational speed.",
    "ingredients_list": "Query about the ingredients required for a recipe.",
    "flight_status": "Check the status of a flight.",
    "goodbye": "Command to end the interaction with the assistant.",
    "update_playlist": "Request to modify or update a music playlist.",
    "restaurant_suggestion": "Ask for recommendations of places to eat.",
    "transactions": "Request to view recent financial transactions.",
    "credit_limit_change": "Request to modify or inquire about a change in credit card limit.",
    "greeting": "Initiate a conversation or greet the assistant.",
    "flip_coin": "Request to simulate flipping a coin.",
    "travel_suggestion": "Ask for recommendations on travel destinations or plans.",
    "book_hotel": "Request to book a hotel.",
    "oil_change_when": "Query about when to change a vehicle's oil.",
    "what_are_your_hobbies": "Ask about the assistant's hobbies or interests.",
    "cancel_reservation": "Request to cancel a reservation.",
    "date": "Query about the current or a specific date.",
    "insurance": "General inquiry about insurance-related topics.",
    "confirm_reservation": "Request to confirm a reservation.",
    "calculator": "Request to perform mathematical calculations.",
    "do_you_have_pets": "Ask if the assistant has or can interact with pets.",
    "bill_balance": "Query about the current balance of a bill.",
    "change_volume": "Request to adjust the volume of the assistant.",
    "oil_change_how": "Request instructions on how to change a vehicle's oil.",
    "thank_you": "Express gratitude to the assistant.",
    "expiration_date": "Query about the expiration date of a product or service.",
    "food_last": "Ask how long a food item will remain fresh or safe to consume.",
    "freeze_account": "Request to freeze a financial or service account.",
    "what_song": "Ask about the song currently playing.",
    "car_rental": "Request information or assistance with renting a car.",
    "pay_bill": "Request to pay a bill.",
    "directions": "Ask for step-by-step navigation or directions.",
    "balance": "Query about the current balance in an account.",
    "lost_luggage": "Request assistance with lost luggage during travel.",
    "schedule_maintenance": "Request to schedule maintenance for a vehicle or system.",
    "last_maintenance": "Query about the date of the last maintenance performed.",
    "gas": "Ask about gas prices or nearest gas stations.",
    "vaccines": "Request information about vaccines or vaccination schedules.",
    "reminder": "Request to set a reminder.",
    "pto_balance": "Check the remaining Paid Time Off (PTO) balance.",
    "calendar": "Request to access or manage calendar events.",
    "are_you_a_bot": "Ask if the assistant is an AI or bot.",
    "travel_alert": "Request information about travel alerts or advisories.",
    "find_phone": "Request assistance with locating a lost phone.",
    "pin_change": "Request to change a security PIN.",
    "next_song": "Command to play the next song in a playlist.",
    "timer": "Set a timer for a specific duration.",
    "reset_settings": "Request to reset device or assistant settings.",
    "carry_on": "Ask about permissible carry-on items for travel.",
    "mpg": "Query about a vehicle's miles-per-gallon efficiency.",
    "meeting_schedule": "Request to schedule a meeting.",
    "smart_home": "Request to control or query about smart home devices.",
    "credit_score": "Ask about the user's current credit score.",
    "text": "Request to send or manage text messages.",
    "next_holiday": "Ask about the date of the next holiday.",
    "card_declined": "Inquiry about why a card transaction was declined.",
    "measurement_conversion": "Request to convert measurements (e.g., inches to centimeters).",
    "user_name": "Query or request to change the user's stored name.",
    "exchange_rate": "Ask for the current currency exchange rates.",
    "gas_type": "Query about the type of gas required for a vehicle.",
    "spelling": "Request the correct spelling of a word.",
    "how_busy": "Ask about the busyness of a place or schedule.",
    "how_old_are_you": "Query about the assistant's age.",
    "sync_device": "Request to synchronize devices with the assistant.",
    "tell_joke": "Ask the assistant to tell a joke.",
    "routing": "Request route planning for travel.",
    "traffic": "Ask about current traffic conditions.",
    "translate": "Request to translate text to another language.",
    "improve_credit_score": "Ask for tips or assistance in improving a credit score.",
    "direct_deposit": "Inquire about setting up direct deposit.",
    "accept_reservations": "Ask if a place or service accepts reservations.",
    "schedule_meeting": "Request to set up a meeting schedule.",
    "new_card": "Request information or assistance with getting a new card.",
    "what_can_i_ask_you": "Query about the assistant's capabilities.",
    "change_language": "Request to change the assistant's language settings.",
    "w2": "Request information or assistance with W-2 forms.",
    "ingredient_substitution": "Ask for substitutes for specific ingredients in a recipe.",
    "weather": "Request current or forecasted weather information.",
    "restaurant_reservation": "Request to book a table at a restaurant.",
    "cancel": "Command to cancel a current operation or request.",
    "spending_history": "Request details about past expenditures.",
    "repeat": "Ask the assistant to repeat its previous response.",
    "pto_used": "Check the amount of Paid Time Off (PTO) already used.",
    "taxes": "Request information about tax-related topics.",
    "report_fraud": "Request to report a fraudulent transaction or activity.",
    "order": "Request to place an order for a product or service.",
    "redeem_rewards": "Request to redeem loyalty or rewards points.",
    "recipe": "Ask for a cooking recipe.",
    "reminder_update": "Request to modify an existing reminder.",
    "tire_pressure": "Query about recommended or current tire pressure.",
    "plug_type": "Ask about compatible plug types for devices or vehicles.",
    "share_location": "Request to share the user's location.",
    "nutrition_info": "Ask about the nutritional content of food or meals.",
    "report_lost_card": "Request to report a lost card.",
    "income": "Query about income-related details.",
    "meaning_of_life": "Ask about the philosophical meaning of life.",
    "restaurant_reviews": "Request reviews for a specific restaurant.",
    "order_checks": "Request to order personal or business checks.",
    "transfer": "Request to transfer money between accounts.",
    "damaged_card": "Report a damaged card and request assistance.",
    "time": "Ask about the current time.",
    "travel_notification": "Notify or inquire about travel plans for financial institutions.",
    "change_ai_name": "Request to change the assistant's name.",
    "shopping_list": "Request to view or manage the shopping list.",
    "who_made_you": "Ask about the creator of the assistant.",
    "fun_fact": "Ask the assistant to share an interesting fact.",
    "change_user_name": "Request to change the user's name in the system.",
    "where_are_you_from": "Ask about the assistant's origin or background.",
    "apr": "Query about the Annual Percentage Rate (APR) for loans or credit.",
    "bill_due": "Ask about the due date for a bill.",
    "min_payment": "Request the minimum payment required for a bill or loan.",
    "alarm": "Request to set or manage an alarm."
  }